def s(r):   #функція для сортування

    n = len(r)  # Дізнаємося довжин списку
    a = n // 2  # Початковий розмір кроку (a), зазвичай половина довжини списку

    # Поки розмір кроку більше нуля
    while a > 0:
        # Проходимо по елементах списку, починаючи з a
        for i in range(a, n):
            # Зберігаємо поточний елемент
            temp = r[i]

            # Зсув елементів, які знаходяться на відстані a, якщо вони більші за temp
            j = i
            while j >= a and r[j - a] > temp:
                r[j] = r[j - a]  # Зсуваємо більший елемент вперед
                j -= a  # Переходимо до наступного елемента з відстанню a

            r[j] = temp  # Вставляємо temp на правильну позицію

        a //= 2  # Зменшуємо крок у два рази для наступного проходу


# Приклад
r = [1025, 85, 1, 8, 39, 24, 2, 3]
print("Початковий список:", r)
s(r)
print("Відсортований список:", r)
